app/controllers/images_controller.rb

INSERT INTO "images" ("user_id", "created_at", "updated_at", "image_file_name", "image_content_type", "image_file_size", "image_updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = current_user

    if params[:images]
      params[:images].each {|image|
      @files = @user.images.create(image: image)