app/controllers/photos_controller.rb

SELECT "photos".* FROM "photos"
SELECT  "votes".* FROM "votes" WHERE "votes"."photo_id" = ? LIMIT ?  [["photo_id", 1], ["LIMIT", 1]]
SELECT SUM("votes"."like") FROM "votes" WHERE "votes"."photo_id" = ?  [["photo_id", 1]]
---
  def index
    @photos = Photo.all
    @like = {}
    @photos.each do |photo|
      @votes = Vote.where(photo_id: photo.id).sum(:like)

INSERT INTO "photos" ("user_id", "category_id", "name", "created_at", "updated_at", "photo") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 8], ["category_id", 1], ["name", "Test photo"], ["created_at", "2017-11-27 15:09:22.711992"], ["updated_at", "2017-11-27 15:09:22.711992"], ["photo", "github-mark.png"]]
---
  def create
   params[:photo][:category_id] = params[:category_id]
   params[:photo][:user_id] = current_user.id
   params[:photo][:photo]
   @photo = Photo.create(photo_params)

SELECT  "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
SELECT  "votes".* FROM "votes" WHERE "votes"."user_id" = ? AND "votes"."photo_id" = ? ORDER BY "votes"."id" ASC LIMIT ?  [["user_id", 8], ["photo_id", 1], ["LIMIT", 1]]
INSERT INTO "votes" ("user_id", "photo_id", "like", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 8], ["photo_id", 1], ["like", 1], ["created_at", "2017-12-01 12:30:58.108930"], ["updated_at", "2017-12-01 12:30:58.108930"]]
UPDATE "votes" SET "like" = ?, "updated_at" = ? WHERE "votes"."id" = ?  [["like", 2], ["updated_at", "2017-12-01 12:38:20.930751"], ["id", 1]]
---
  def vote
    @photo = Photo.find(params[:id])
    @vote = Vote.where(user_id: current_user.id, photo_id: @photo.id).first
    if @vote == nil
        @like = 1
        Vote.create(user_id: current_user.id, photo_id: @photo.id, like: @like)
    else
    	if @vote.like == 0
    		@vote.update(like: @vote.like+1)