app/controllers/posts_controller.rb

SELECT "postcomments".* FROM "postcomments" WHERE "postcomments"."post_id" = ?  [["post_id", 1]]
---
      def show
    @comments = Postcomment.where(post_id: @post.id)

INSERT INTO "posts" ("user_id", "title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 3], ["title", "title"], ["body", "rrrrrrrrrrrrrrrrrrrrr"], ["created_at", "2017-10-20 08:12:05.200897"], ["updated_at", "2017-10-20 08:12:05.200897"]]
---
      def create
    @post = current_user.posts.build(post_params)
    if @post.save

UPDATE "posts" SET "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["body", "ccccccct"], ["updated_at", "2017-10-20 11:29:10.276424"], ["id", 4]]
---
     def update
    @post.update(post_params)