app/controllers/postcomments_controller.rb

def create
	params[:postcomment][:post_id] = params[:post_id]
	params[:postcomment][:user_id] = current_user.id
	@comment = Postcomment.create(postcomments_params)
---
INSERT INTO "postcomments" ("text", "post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["text", "wewewe"], ["post_id", 1], ["user_id", 5], ["created_at", "2017-11-10 08:27:31.350949"], ["updated_at", "2017-11-10 08:27:31.350949"]]